#!/usr/bin/env ruby
# -*- coding: utf-8 -*-

#########################################################
# 設定ファイル
# Version: 0.1.0
# Author: Yoichiro Hasebe
# Modified: 2013/08/26
#########################################################

##### 設定項目 #####
$MECAB_VERSION = "0.996"
$UNIDIC_VERSION = "2.1.2"
$SUB_DIRECTORY = "" # 運用時のサブディレクトリ
$MAX_NUM_CHARACTERS = 20000   # 入力テキスト文字数制限値
$READABILITY_CONSTANT = 3.989  # 定数
$READABILITY_FACTORS = [
  ["感動詞-一般", 0.105],
  ["形状詞", 0.001],
  ["形容詞", -0.013],
  ["助詞", -0.001],
  ["助動詞", -0.001],
  ["接続詞", 0.012],
  ["代名詞", -0.029],
  ["動詞", -0.018],
  ["副詞", -0.037],
  ["固有名詞", 0.014],
  ["普通名詞", -0.016],
  ["連体詞", -0.064],
  ["総文数", 0.011],
  ["文の平均語数", -0.041],
  ["総形態素数", 0.006]
]
$DB_PATH = File.expand_path(File.dirname(__FILE__) + "/data")
###################